# Проверка Честности Партии
Наиболее простым способом будет вызвать список хэшей транзакций партии через сервер Blind Croupier, обращаем ваше внимание что вся информация хранится и берется из блокчейна Ethereum.

Создадим ссылку и перейдем по ней: `http://blind-croupier.herokuapp.com/api/v1/transactions?address=**ADDRESS**&gameId=**GAMEID**`.
> Вам нужно подставить свой адрес кошелька вместо ``**ADDRESS**`` и необходимый gameID вместо ``**GAMEID**`` например ``http://blind-croupier.herokuapp.com/api/v1/transactions?address=0x28edfb3a45101d7241788c09161f561e57bb53e6&gameId=0``

После перехода по ссылке появится список хэшей транзакций партии, ставки, сиды, начальная рука, команды замены, рука после замены :

```json
{
    "BetSubmitted": {
        "txHash": "0x31a7368260c0a2f8ddad9afecea9ebac1bc97a4274c695fe3ee03b3be9be93a2",
        "bet": 1,
        "level": 1,
        "betPayment": "0.1 eth (1 chips)"
    },
    "CroupierSeedSubmitted: 0": {
        "txHash": "0x0297d8b91e3cea22a3e862e5a146949840e40298c5971cd116fa104bc53352bd",
        "seed": "62504461"
    },
    "CroupierSeedSubmitted: 1": {
        "txHash": "0x4ebae8c3581ed06d6e1e9aa483a363070a9a0c3dd84d77d5ce20c3954f63fc17",
        "seed": "1600494777"
    },
    "PlayerSeedSubmitted: 0": {
        "txHash": "0xe9c4d33b97d3cbaf8ce60a60bbf9f543badfeb43bf2626dd1bf038dcb99ebafd",
        "seed": "393532593"
    },
    "PlayerSeedSubmitted: 1": {
        "txHash": "0x551a2fb28fca743035ffd3eacdec9bb0917b24b74baa2462e35425aef0b7b028",
        "seed": "1301748256"
    },
    "InitialHand": "5♢, 7♢, 9♧, 10♧, 7♡",
    "ReplacementOrderSubmitted": {
        "txHash": "0xa72ded162330c6d60b5de4728e7d216f1b6ae609a04b3854e6d6b9c45bd54e11",
        "replacementOrder": [
            "1",
            "0",
            "1",
            "1",
            "0"
        ]
    },
    "GameFinishedEvent": {
        "txHash": "0x97de8fd8a8af1bd67668cdf49cd89adf74402d1f095fa24a4b9b374b4edf40f2",
        "winCoef": 3,
        "winPayment": "0.3 eth (3 chips)"
    },
    "FinalHand": "3♡, 7♢, J♧, 7♤, 7♡"
}
```

Как видите честность игры действительно легко проверяется и записана в блокчейне. Мы все еще ведем работу над улучшенным интерфейсом проверки на честность.

# Глубокое Изучение Транзакций
К сожалению самостоятельное изучение транзакций может потребовать от вас некоторых технических навыков, в этом гайде мы не будем описывать основные понятия криптографии или каким образом образуется тот или иной параметр. Обширную информацию о работе алгоритма вы можете узнать из технической White Paper или задав вопрос в сообществах Blind Croupier Slack или Telegram. 

В этом же гайде мы по порядку будем исследовать хэши транзакций. Для просмотра вызываемого метода и его параметров мы будем подставлять в ссылку на эфирскане, `http://kovan.etherscan.io/tx/**TXHASH**`, необходимый `TXHASH` - для метода из списка (`submitBet`, `submitCrouiperSeedAsSignature`, `submitReplacementOrder` и т.д. ). После перехода по ссылке нас будет интересовать поле `Input Data`, в котором указано название функции и список ее аргументов, исследование всех методов будет происходить по схожей аналогии. 

## Шаг первый: изучение сделанных ставок
Для изучения информации о сделанных ставках необходимо подставить соответствующий ``"txHash"`` для метода `submitBet` будем следовать и дальше анализу одной конкретной партии поэтому возьмем соответствующий хэш``"0x31a7368260c0a2f8ddad9afecea9ebac1bc97a4274c695fe3ee03b3be9be93a2",`` и подставим в ссылку после чего перейдем по ней https://kovan.etherscan.io/tx/0x31a7368260c0a2f8ddad9afecea9ebac1bc97a4274c695fe3ee03b3be9be93a2

В `Input Data` отобразятся необходимые параметры.

```
[0]:000000000000000000000000f0005d5b6bf7f42a1e92d0cbbbc75f9773d4158d
[1]:0000000000000000000000001d6acdeb2eada5feca9fe4c78870d0c06f5f1745
[2]:0000000000000000000000000000000000000000000000000000000000000001
[3]:0000000000000000000000000000000000000000000000000000000000000001
[4]:000000000000000000000000000000000000000000000000000000000000001c
[5]:e6c459c79f9ee1c2f1c69858e92cdef31b0287d036b4b37d48059c4410882551
[6]:6b0d4e80a245a78dc2c044a6ad9d6a38c16e338910c621490784e83df74e5334
```

Параметр `0` это адрес кошелька крупье:
```
[0]:000000000000000000000000f0005d5b6bf7f42a1e92d0cbbbc75f9773d4158d == 
                              0x5d5b6bf7f42a1e92d0cbbbc75f9773d4158d
```

Параметр `1` это адрес кошелька игрока:

```
0000000000000000000000001d6acdeb2eada5feca9fe4c78870d0c06f5f1745 == 
                      0x1d6acdeb2eada5feca9fe4c78870d0c06f5f1745
```

Параметр `2` это ставка:

```
0000000000000000000000000000000000000000000000000000000000000001 === 1
```

И параметр `3` уровень:

```
0000000000000000000000000000000000000000000000000000000000000001 === 1
```

## Шаг второй: сиды

Далее по аналогии с первым шагом, подставим необходимый ``TxHash`` для метода: `submitCrouiperSeedAsSignature`

https://kovan.etherscan.io/tx/0x0297d8b91e3cea22a3e862e5a146949840e40298c5971cd116fa104bc53352bd

Параметры ``InputData``:

```
[0]:000000000000000000000000f0005d5b6bf7f42a1e92d0cbbbc75f9773d4158d
[1]:0000000000000000000000001d6acdeb2eada5feca9fe4c78870d0c06f5f1745
[2]:000000000000000000000000000000000000000000000000000000000000001b
[3]:007169e25b14d495a0a998522d8b02f1aa0121cfd3efa48fe04244d603b9be0d
[4]:6059b49f79bb31333ae34d9456d4e9d16a47bfc44ce803d49ebdf82deb2f64a8
[5]:0000000000000000000000000000000000000000000000000000000000000000
```

Нас интересует параметр `3` (поле `r` подписи): 

```
r = 007169e25b14d495a0a998522d8b02f1aa0121cfd3efa48fe04244d603b9be0d
```

Для получения сида необходимо взять последние **4 байта** от данного числа (то есть **8 последних шестнадцатеричных цифр**):

```
seed = 007169e25b14d495a0a998522d8b02f1aa0121cfd3efa48fe04244d603b9be0d ^ ffffff == 03b9be0d
```

Преобразуем данный сид к десятеричному представлению (например [здесь](http://www.binaryhexconverter.com/hex-to-decimal-converter)):

```
03b9be0d = 62504461
```

что сходится с полем `seed` в событии:

```
"seed": "62504461"
```

Остальные сиды (Croupier 1, Player 0, Player 1) вычисляются и проверяются аналогично.


## Шаг третий: транзакция команды замены карт

Имя метода: `submitReplacementOrder`

Транзакция: 
https://kovan.etherscan.io/tx/0xa72ded162330c6d60b5de4728e7d216f1b6ae609a04b3854e6d6b9c45bd54e11


Параметры ``InputData``:

```
[0]:000000000000000000000000f0005d5b6bf7f42a1e92d0cbbbc75f9773d4158d
[1]:0000000000000000000000001d6acdeb2eada5feca9fe4c78870d0c06f5f1745
[2]:0000000000000000000000000000000000000000000000000000000000000001
[3]:0000000000000000000000000000000000000000000000000000000000000000
[4]:0000000000000000000000000000000000000000000000000000000000000001
[5]:0000000000000000000000000000000000000000000000000000000000000001
[6]:0000000000000000000000000000000000000000000000000000000000000000
[7]:000000000000000000000000000000000000000000000000000000000000001b
[8]:94f391c2a72a80d29c23907a6df4a9505f578acaed8f6c2d1f62e225b6dbcd55
[9]:0781d82e3e5063426d7413285d52941cea761e6da3f649d00391c6af5676a114
```

Параметры `0` и `1` это адреса Крупье и Игрока.

Параметры `2` - `6` это команда замены. `0` означает оставить карту (HOLD), `1` - заменить карту.

## Шаг пятый: команда расчета партии и результат игры

Открываем логи последней транзакции `GameFinishedEvent`: 

https://kovan.etherscan.io/tx/0x97de8fd8a8af1bd67668cdf49cd89adf74402d1f095fa24a4b9b374b4edf40f2#eventlog

В логах два события:

```
[0] 000000000000000000000000f0005d5b6bf7f42a1e92d0cbbbc75f9773d4158d
[1] 0000000000000000000000001d6acdeb2eada5feca9fe4c78870d0c06f5f1745
[2] 0000000000000000000000000000000000000000000000000429d069189e0000
 		
[0] 0x2e26679f09e74f31e637088f9820b9f39ae1da7796c9ab18fb06227464eeff59
[1] 0x000000000000000000000000f0005d5b6bf7f42a1e92d0cbbbc75f9773d4158d
[2] 0x0000000000000000000000001d6acdeb2eada5feca9fe4c78870d0c06f5f1745
[3] 0x0000000000000000000000000000000000000000000000000000000000000003
 ```

Первое событие - движение денежных средств. Поля по порядку.

Адрес крупье: 
```
[0] 000000000000000000000000f0005d5b6bf7f42a1e92d0cbbbc75f9773d4158d
```

Адрес игрока: 
```
[1] 0000000000000000000000001d6acdeb2eada5feca9fe4c78870d0c06f5f1745
```

Количество Wei выплаты(используем уже нам знакомый [хекс конвертер](http://www.binaryhexconverter.com/hex-to-decimal-converter)):

```
[2] 0000000000000000000000000000000000000000000000000429d069189e0000 = 
300000000000000000 Wei = 
0.3 ETH
```

## Проверка сгенерированной руки

Как проверить, что Крупье и Банк сгенерировали верную финишную руку?

У нас есть четыре случайных сида:

```
62504461 (Крупье 0)
393532593 (Игрок 0)
1600494777 (Крупье 1)
1301748256 (Игрок 1)
```

Для начала смешаем сиды попарно (Игрок 0 + Крупье 0, Игрок 1 + Крупье 1, используя исключающее ИЛИ (XOR, ^). Можно использовать, например, калькулятор: http://xor.pw/ (не забудьте выставить Base 10 для ввода и вывода). 

Результат:

```
15316196254
83182558959
```

Первый сид используется для первой тасовки колоды. После чего из нее извлекается 5 карт. Остаток колоды тасуется с помощью второго сида и из колоды извлекается столько карт, сколько нужно для замены.

Проверить финальную руку Игрока, имея оба сида и команду замены, можно вызвав функцию `generateHand` из Банка, передав ей оба сида и команду замены.
Результат вызова опубликован в первоначальном ответе:

```
"FinalHand": "3♡, 7♢, J♧, 7♤, 7♡"
```
